package com.keyin.opration.spectralclustering;

/**
 * @description:
 * K-means 为啥不能解决，因为每个被聚类对象只关心自己，没有大局观，对于双环是不是得有大局观？换言之，只关系类内间距
 * 不关系类间问题。
 * 目标：子图间的邻接最小 && 子图内的邻接最大 按这个目标去做其实没法解决，np问题。但是推导过程发现这个其实
 * 等价于说求求解其拉普拉斯矩阵的特征向量的聚类
 * （这个矩阵包含有邻接信息，出度信息， 同时具备一些性质）
 * 那就把np->p问题
 * 7. 对矩阵Y按每行为一个数据点，进行k-means聚类，第ii行所属的类就是原来xixi所属的类。
 * 6. 归一化X形成矩阵Y
 * 7. 对矩阵Y按每行为一个数据点，进行k-means聚类，第ii行所属的类就是原来xixi所属的类。
 * 
 * 优点：图分类好（），高维度好（降维），全局最优
 * 缺点：参数敏感，对边的定义要结合业务
 * 
 * @author: yinke
 * @create: 2021-05-12 10:23
 **/

public class SpectralClustering {
}
